blog-posts/2003-03-17-talas-open-source-interview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>tala's open source interview</title>
<!-- 2014-04-30 Wed 16:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">tala's open source interview</h1>
<p>
March 17th, 2003 -
<a href="http://sachachua.com/blog/p/518"><a href="http://sachachua.com/blog/p/518">http://sachachua.com/blog/p/518</a></a>
</p>

<p>
Not one of my most coherent responses, but it must be done.
</p>

<p>
<b>How do you/does your organization support and advocate Open Source
 Software? What activities have you spearheaded or joined in?</b>
</p>

<p>
I maintain or contribute source code and time to a few open source
 projects like the Emacs Planner module. I've given several talks at
 local Linux events such as the UP Open Source Day held on February 20,
 2003, and the Ateneo I.T. Forum held on March 7, 2003. I am also the
 current vice president of the Philippine Linux Users Group and I am
 active in a couple of mailing lists like plug and ph-linux-newbie.
</p>

<p>
<b>Why do you support the use of Open Source Software?</b>
</p>

<p>
Because it's fun. Because it helps me practice my skills. Because it
 gives me bucketloads of free software that I can use, customize, debug
 and develop. Because it helps me make a difference.
</p>

<p>
What are the advantages of using Open Source Software over
</p>

<blockquote>
<p>
Proprietary Software generally and specifically for the Philippines?
 From a techie's point of view? From a layman's point of view (such
 as a student or an office secretary or clerk)?
</p>
</blockquote>

<p>
Speaking as a techie, I find open source to be absolutely wonderful. I
 can learn as much as I want from whatever software program I choose. I
 can tweak, experiment, and rewrite to my heart's content. For me, free
 and open source software is about freedom &#x2013; the freedom to learn, the
 freedom to improve.
</p>

<p>
You might also be interested in an essay of mine.
<a href="http://www.inq7.net/inf/2002/sep/26/inf_27-1.htm"><a href="http://www.inq7.net/inf/2002/sep/26/inf\_27-1.htm">http://www.inq7.net/inf/2002/sep/26/inf\_27-1.htm</a></a>
</p>

<p>
<b>What is the current state of Open Source Software in the Philippines?</b>
</p>

<p>
You might want to check out the openminds\<sub>ph</sub> archives for a lot of
 discussion on that.
<a href="http://groups.yahoo.com/groups/openminds_ph"><a href="http://groups.yahoo.com/groups/openminds\_ph">http://groups.yahoo.com/groups/openminds\_ph</a></a>
</p>

<p>
<b>In your opinion, will the use of Open Source Software spread and
 gain more popularity? What factors will help the spread of use?</b>
</p>

<p>
I don't see why not. Open source software just makes a lot of sense to
 me. There are a lot of companies and schools looking into open
 source, and even our government is slowly exploring open source.
</p>

<p>
<b>What factors will hinder the spread of the use of Open Source
 Software in the Philippines?</b>
</p>

<p>
Many businesses are locked into proprietary solutions because they'd
 come to rely on a single vendor, and big software companies try to
 make sure that people don't know they have alternatives. For example,
 if you didn't know that you could save files in other formats simply
 by using the File -&gt; Save As command in Microsoft Word, you'd end up
 saving in the closed Microsoft Word format. If you're using something
 like Microsoft Word 2002 and your friends only have Microsoft Word 98,
 they'll have to buy new software just to open your file. People buy
 Microsoft Office because “everyone else uses it.”
</p>

<p>
There's also the impression that open source is intimidating and that
 it's only for geeks. A lot of work is being done to improve it on the
desktop,
 and companies are springing up to provide Linux support.
</p>

<p>
<b>In your opinion, does Open Source Software have a future in the
 Philippine IT industry?</b>
</p>

<p>
Definitely.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
